// Напишіть функцію getArea(number), яка обчислює площу круга. 
// Для визначення площі використовуйте Math. 
// В залежності від того що передали в функцію має виводити 
// наступні повідомлення:
// •	Якщо передане число повертати - Площа дорівнює 
// стільки то квадратних одиниць.
// •	Якщо передали не число - Повинно бути числове значення.
// •	Якщо в функцію нічого не передали - Будь ласка, введіть
//  радіус!

// let result = 0;
// const func = function getArea(r) {
//    return Math.PI * r ** 2;
// } 
// if (result !== Number) {
//    console.log('Введіть числове значення');
// } else 
// if (result === null) {
//    console.log('Будь ласка, введіть радіус!')
// }
// console.log(func(5))

// Напишіть функцію getSqrt(number), яка вираховує корінь квадратний. Для визначення кореня використовуйте Math. 
// В залежності від того що передали в функцію має виводити
// наступні повідомлення:
// •	Якщо передане число повертати - Квадратний корінь з стільки 
// то дорівнює стільки то.
// •	Якщо передали не число - Повинно бути числове значення.
// •	Якщо число менше 0 - Введіть додатнє число.
// •	Якщо в функцію нічого не передали - Будь ласка, введіть число!


// let result = 0;
// const func = function getSqrt(number) {
//    return result = result + Math.sqrt(number);
// }
// console.log(func(25))


// Створіть об’єкт getMath який буде реалізовувати наступний
//  функціонал:
// •	getMath.PI – це властивість яка має повертати число Pi.
// •	getMath.pow(number, degree) – це метод який має повертати 
// число в певній степені.
// •	getMath.abs(number) – це метод який має повертати модулю
//  числа.
// •	getMath.max(number1, number2…) – це метод який має 
// повернути максимальне число з переданих. Кількість чисел необмежена.
// •	getMath.min(number1, number2…) – це метод який має 
// поаернути мінімальне число з переданих. Кількість чисел необмежена.
// Також ви маєте повернути наступні повідомлення при використанні 
// методів, якщо:
// •	Якщо передали не число - Повинно бути числове значення.
// •	Якщо в функцію нічого не передали - Будь ласка, введіть 
// число або числа(в залежності від методу)!
// При створенні цих методів використання об’єкту Math заборонене!
let getMath = new Object;
getMath [
   getMath.PI = '3.14',
   ]


getMath['getMath.pow'] = function pow(number, degree) {
   let result = number;
   for (let i = 1; i < n; i++) {
      result *= number;
   }
   return result;
};



console.log(getMath.getMath.pow(5,5))