
// Напишіть функцію getSqrt(number), яка вираховує корінь квадратний. Для визначення кореня використовуйте Math. 
// В залежності від того що передали в функцію має виводити
// наступні повідомлення:
// •	Якщо передане число повертати - Квадратний корінь з стільки 
// то дорівнює стільки то.
// •	Якщо передали не число - Повинно бути числове значення.
// •	Якщо число менше 0 - Введіть додатнє число.
// •	Якщо в функцію нічого не передали - Будь ласка, введіть число!


// let result = 0;
// const func = function getSqrt(number) {
//    return result = result + Math.sqrt(number);
// }
// console.log(func(25))

