// Напишіть функцію getArea(number), яка обчислює площу круга. 
// Для визначення площі використовуйте Math. 
// В залежності від того що передали в функцію має виводити 
// наступні повідомлення:
// •	Якщо передане число повертати - Площа дорівнює 
// стільки то квадратних одиниць.
// •	Якщо передали не число - Повинно бути числове значення.
// •	Якщо в функцію нічого не передали - Будь ласка, введіть
//  радіус!

// const func = function getArea(r) {
//     if (r === null) {
//       console.log('Будь ласка, введіть радіус!')
//    }
//    return Math.PI * r ** 2;
// }  

// console.log(func(5))
