
// Створіть об’єкт getMath який буде реалізовувати наступний
//  функціонал:
// •	getMath.PI – це властивість яка має повертати число Pi.
// •	getMath.pow(number, degree) – це метод який має повертати 
// число в певній степені.
// •	getMath.abs(number) – це метод який має повертати модулю
//  числа.
// •	getMath.max(number1, number2…) – це метод який має 
// повернути максимальне число з переданих. Кількість чисел необмежена.
// •	getMath.min(number1, number2…) – це метод який має 
// поаернути мінімальне число з переданих. Кількість чисел необмежена.
// Також ви маєте повернути наступні повідомлення при використанні 
// методів, якщо:
// •	Якщо передали не число - Повинно бути числове значення.
// •	Якщо в функцію нічого не передали - Будь ласка, введіть 
// число або числа(в залежності від методу)!
// При створенні цих методів використання об’єкту Math заборонене!



// let getMath = {
//    PI: Math.PI,
//    pow: Math.pow(5,2),
//    abs: Math.abs(-5),
//    max: Math.max(50,80,5,24,1112,484984),
//    min: Math.min(-1,0,84,478),
// }
// console.log(getMath.abs)


